tap "homebrew/command-not-found"

# unix core
brew 'less'
brew 'watch'
brew 'tree'
brew 'psgrep'
brew 'pstree'
brew 'pv'
brew 'findutils'
brew 'gnu-sed'
brew 'diffutils'

# common build deps


# unix basics
brew 'git'
brew 'gnupg'
brew 'socat'
brew 'stdman'
brew 'tmux'
brew 'util-linux'
brew 'wget'
brew 'diffstat'
brew 'rsync'

# python basics
brew 'virtualenv'
brew 'tox'
brew 'python@3.8'
brew 'python@3.9'
brew 'python@3.10'
brew 'python@3.11'
brew 'proctools'

# unix super-handy
brew 'direnv'
brew 'dotenv-linter'
brew 'jq'
brew 'yq'
brew 'graphviz'
brew 'rlwrap'

# unix quality of life
brew 'neovim'
brew 'fish'
brew 'gh'
brew 'bash-completion@2'
brew 'zsh-completions'
brew 'toilet'
brew 'shellcheck'
brew 'markdownlint-cli'
brew 'fzf'

# opensource prerequisites
brew 'go'
brew 'gradle'
brew 'opam'
brew 'openjdk'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'helm'
brew 'luarocks'
brew 'virtualenv'
brew 'typescript'
brew 'rustup-init'
brew 'pnpm'

# terraform stuffs
brew 'tfenv'   # provides `terraform`
brew 'terraform-docs'
brew 'terrascan'
brew 'tflint'
brew 'tfsec'
brew 'tfupdate'

## not 100% sure:
#brew tldr
#brew httpie
#brew libfaketime
#brew slackcat

cask '1password-cli'
cask 'chromedriver'
cask 'docker'
cask 'google-cloud-sdk'

cask 'homebrew/cask-fonts/font-inconsolata-nerd-font'
