tap "homebrew/command-not-found"

# unix core
brew 'less'
brew 'watch'
brew 'tree'
brew 'psgrep'
brew 'pstree'
brew 'pv'
brew 'findutils'
brew 'gnu-sed'
brew 'diffutils'

# common build deps
brew 'llvm'  # provides clang/clang++ compiler for ~/bin/alternatives/g++ wrapper
brew 'lld'   # LLVM linker, required by g++ wrapper (~/bin/alternatives/ld -> lld)


# unix basics
brew 'git'
brew 'gnupg'
brew 'socat'
brew 'stdman'
brew 'tmux'
brew 'util-linux'
brew 'wget'
brew 'diffstat'
brew 'rsync'

# python basics
brew 'virtualenv'
brew 'tox'
brew 'python@3.8'
brew 'python@3.9'
brew 'python@3.10'
brew 'python@3.11'
brew 'proctools'

# unix super-handy
brew 'direnv'
brew 'dotenv-linter'
brew 'jq'
# tier 2: brew 'yq'
# tier 2: brew 'graphviz'
# tier 2: brew 'rlwrap'

# unix quality of life
brew 'neovim'
brew 'gh'
brew 'zsh-completions'
# tier 2: brew 'toilet'
# tier 2: brew 'bash-completion@2'
# tier 2: brew 'shellcheck'
# tier 2: brew 'markdownlint-cli'
# tier 3: brew 'fzf'
# tier 4: brew 'fish'

# opensource prerequisites
brew 'go'
brew 'rbenv'
brew 'luarocks'  # required by several nvim plugins
brew 'virtualenv'
brew 'typescript'
brew 'rustup-init'
# tier 3: brew 'pnpm'
# tier 4: brew 'gradle'
# tier 4: brew 'opam'
# tier 4: brew 'openjdk'
# tier 5: brew 'helm'

# terraform stuffs
brew 'tfenv'   # provides `terraform`
brew 'terraform-docs'
brew 'tflint'
brew 'tfsec'
# tier 2: brew 'tfupdate'
# tier 2: brew 'terrascan'

## not 100% sure:
#brew tldr
#brew httpie
#brew libfaketime
#brew slackcat

cask '1password-cli'
cask 'chromedriver'
cask 'docker'
cask 'google-cloud-sdk'

cask 'homebrew/cask-fonts/font-inconsolata-nerd-font'
